{
  "intro": {
    "firstName": "Gabriel",
    "lastName": "Mochi",
    "role": "Senior Full Stack Developer"
  },
  "contact": {
    "label": "Contact",
    "location": {
      "label": "Location",
      "value": "Montreal, QC, Canada"
    },
    "email": {
      "label": "E-mail",
      "value": "contact@gabrielmochi.dev"
    },
    "portfolio": {
      "label": "Portfolio"
    }
  },
  "social": {
    "label": "Social",
    "linkedin": {
      "label": "LinkedIn"
    },
    "github": {
      "label": "Github"
    },
    "stackOverflow": {
      "label": "Stack Overflow"
    }
  },
  "academicEducation": {
    "label": "Academic Education",
    "incomplete": "incomplete",
    "records": {
      "fatec": {
        "courseTitle": "Analysis and Systems Development",
        "institutionName": "Faculdade de Tecnologia de São Paulo (FATEC-SP)"
      },
      "ifsp": {
        "courseTitle": "Professional Degree in Information Technology",
        "institutionName": "Instituto Federal de São Paulo (IFSP)"
      }
    }
  },
  "certifications": {
    "label": "Certifications",
    "records": {
      "conquer": {
        "certificationTitle": "Grow your business (Entrepreneurship)",
        "institutionName": "Conquer School"
      },
      "conquerSales": {
        "certificationTitle": "Negotiation, Influence and Sales",
        "institutionName": "Conquer School"
      },
      "ibmBluemix": {
        "certificationTitle": "Bluemix Essentials",
        "institutionName": "IBM"
      },
      "prandiano": {
        "certificationTitle": "Applied Mathematics",
        "institutionName": "Prandiano - Museum of Mathematics"
      }
    }
  },
  "about": {
    "title": "about",
    "description": "I'm a **Senior Full Stack Developer** with strong software engineering expertise and **over eight years of experience** building scalable web applications, APIs, and process automation. I specialize in delivering clean, maintainable, and human-readable code that follows best practices and solid architectural principles.\n\n**My core tech stack includes:** Node.js, NestJS, TypeScript, JavaScript, Express, Redis (Backend); React, Next.js, HTML, CSS, TailwindCSS (Frontend); PostgreSQL, MongoDB (Databases); and Docker, GCP, CI/CD (DevOps/Other).\n\nI'm passionate about learning new technologies and methodologies, and I'm always looking for opportunities to grow and improve my skills. I'm a team player who enjoys collaborating with others to solve complex problems and deliver high-quality software solutions."
  },
  "professionalHistory": {
    "periodDateFormat": "MMM YYYY",
    "present": "Present",
    "title": "Professional Experience",
    "records": {
      "estateably": {
        "company": "Estateably",
        "jobTitle": "Senior Full Stack Developer",
        "location": {
          "city": "Montreal",
          "state": "QC",
          "country": "Canada"
        },
        "description": {
          "highlights": [
            "Developed multiple enhancements for projects in the legal and financial sectors by adding new features, resolving bugs, and addressing technical debt across the frontend (React + TypeScript) and backend (Node.js).",
            "Played a key role in designing and developing a new vault platform, utilizing NestJS + TypeScript for the backend and React for the frontend, with data stored in MongoDB and files managed in AWS S3.",
            "Worked closely with the team to integrate and restructure the payment system, enhancing Stripe payment processing functionality.",
            "Improved test coverage by implementing and maintaining E2E (Cypress), unit (Jest), and integration tests for new and modified features, ensuring higher reliability and stability.",
            "Contributed to enhancing OpenAPI (Swagger) documentation by adding and refining API specifications as new endpoints were introduced or modified."
          ]
        }
      },
      "monis": {
        "company": "Monis",
        "jobTitle": "Founding Engineer",
        "location": {
          "city": "São Paulo",
          "state": "SP",
          "country": "Brazil"
        },
        "description": {
          "highlights": [
            "Contributed to the architecture of the server-side application, utilizing NestJS (Node.js) and TypeScript. The application integrated seamlessly with a PostgreSQL database via TypeORM, employed Redis for queue orchestration, and connected to external APIs such as Auth0 for user session management, AWS SES, and Stripe for payment processing.",
            "Played a pivotal role in developing the web platform using Next.js and Chakra UI, creating the first interface for users to engage with the Monis system.",
            "Designed and developed an intuitive admin portal using Flutter for the web, empowering employees to manage users more efficiently.",
            "Implemented the initial CI/CD processes and automated testing, significantly improving the reliability and stability of Monis' applications.",
            "Built and optimized container structures with Docker for seamless application deployment within a GCP-based infrastructure.",
            "Mentored and assisted with the onboarding of new team members, ensuring smooth integration into the development process and alignment with the company culture and best practices."
          ]
        }
      },
      "mutant": {
        "company": "Mutant",
        "jobTitle": "Back End Engineer",
        "location": {
          "city": "São Paulo",
          "state": "SP",
          "country": "Brazil"
        },
        "description": {
          "highlights": [
            "Contributed to the development of chatbot flows using Node.js and TypeScript, ensuring accurate and contextually relevant responses based on user message intent. Integrated external NLP services for efficient intent detection.",
            "Focused on enhancing WhatsApp-based interactions, and facilitated HTTP calls to Google Maps APIs, delivering location-based information within specific chatbot flows."
          ]
        }
      },
      "kpmg": {
        "company": "KPMG",
        "jobTitle": "Junior Full Stack Developer",
        "location": {
          "city": "São Paulo",
          "state": "SP",
          "country": "Brazil"
        },
        "description": {
          "highlights": [
            "Created web portals using Vue.js/Nuxt and Node.js, providing users access to artificial intelligence tools. Data and records were stored in a MongoDB database, with user sessions managed through Redis.",
            "Designed and deployed chatbots with Node.js to enhance organizational communication, integrating cognitive conversational capabilities from IBM Watson Conversation and Microsoft Bot Framework.",
            "Automated several internal audit and financial services processes with Node.js, integrating with Watson APIs (IBM Cloud) and Microsoft Azure AI services as per clients' requests.",
            "Developed web scrapers using tools like Selenium and Puppeteer to extract data from websites."
          ]
        }
      },
      "britech": {
        "company": "BRITech",
        "jobTitle": "Developer Intern",
        "location": {
          "city": "São Paulo",
          "state": "SP",
          "country": "Brazil"
        },
        "description": {
          "highlights": [
            "Developed a ChatBot for first-level support, designed to assist users with questions about the usability of an internal product provided by BRITech. Users interacted with the bot through a web application built with HTML, CSS, and JavaScript. The messaging service was developed in Node.js, integrating with IBM Watson's NLP services via an API to provide answers to user inquiries.",
            "Leveraged the bot's capabilities by creating a Node.js service that integrated ZenDesk requests with IBM Watson APIs, enabling users who opened tickets in ZenDesk to receive personalized, instant responses from the bot without requiring human intervention.",
            "Collaborated within a squad to implement improvements and bug fixes for a frontend project built with the Aurelia framework and TypeScript."
          ]
        }
      }
    }
  }
}
